## Plan for api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`





```terraform
Plan: 10 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_sns_topic.critical will be created
  + resource "aws_sns_topic" "critical" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = "arn:aws:kms:ca-central-1:507252742351:key/f0adf18d-9e68-4641-be1a-55a6a91cca02"
      + name                        = "critical-alert-scan"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + tags                        = {
          + "CostCenter" = "scan-websites-production"
        }
      + tags_all                    = {
          + "CostCenter" = "scan-websites-production"
        }
    }

  # aws_sns_topic.warning will be created
  + resource "aws_sns_topic" "warning" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = "arn:aws:kms:ca-central-1:507252742351:key/f0adf18d-9e68-4641-be1a-55a6a91cca02"
      + name                        = "warning-alert-scan"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + tags                        = {
          + "CostCenter" = "scan-websites-production"
        }
      + tags_all                    = {
          + "CostCenter" = "scan-websites-production"
        }
    }

  # module.ops_alarms.aws_cloudwatch_log_metric_filter.user_alarm_failure["ops1"] will be created
  + resource "aws_cloudwatch_log_metric_filter" "user_alarm_failure" {
      + id             = (known after apply)
      + log_group_name = "CloudTrail/Landing-Zone-Logs"
      + name           = "ops1_ConsoleLogin_Failure"
      + pattern        = "{ $.eventName = \"ConsoleLogin\" && $.userIdentity.userName = \"ops1\" && $.responseElements.ConsoleLogin = \"Failure\" }"

      + metric_transformation {
          + name      = "ops1_ConsoleLogin_Failure"
          + namespace = "ops_alarms"
          + unit      = "Count"
          + value     = "1"
        }
    }

  # module.ops_alarms.aws_cloudwatch_log_metric_filter.user_alarm_failure["ops2"] will be created
  + resource "aws_cloudwatch_log_metric_filter" "user_alarm_failure" {
      + id             = (known after apply)
      + log_group_name = "CloudTrail/Landing-Zone-Logs"
      + name           = "ops2_ConsoleLogin_Failure"
      + pattern        = "{ $.eventName = \"ConsoleLogin\" && $.userIdentity.userName = \"ops2\" && $.responseElements.ConsoleLogin = \"Failure\" }"

      + metric_transformation {
          + name      = "ops2_ConsoleLogin_Failure"
          + namespace = "ops_alarms"
          + unit      = "Count"
          + value     = "1"
        }
    }

  # module.ops_alarms.aws_cloudwatch_log_metric_filter.user_alarm_success["ops1"] will be created
  + resource "aws_cloudwatch_log_metric_filter" "user_alarm_success" {
      + id             = (known after apply)
      + log_group_name = "CloudTrail/Landing-Zone-Logs"
      + name           = "ops1_ConsoleLogin_Success"
      + pattern        = "{ $.eventName = \"ConsoleLogin\" && $.userIdentity.userName = \"ops1\" && $.responseElements.ConsoleLogin = \"Success\" }"

      + metric_transformation {
          + name      = "ops1_ConsoleLogin_Success"
          + namespace = "ops_alarms"
          + unit      = "Count"
          + value     = "1"
        }
    }

  # module.ops_alarms.aws_cloudwatch_log_metric_filter.user_alarm_success["ops2"] will be created
  + resource "aws_cloudwatch_log_metric_filter" "user_alarm_success" {
      + id             = (known after apply)
      + log_group_name = "CloudTrail/Landing-Zone-Logs"
      + name           = "ops2_ConsoleLogin_Success"
      + pattern        = "{ $.eventName = \"ConsoleLogin\" && $.userIdentity.userName = \"ops2\" && $.responseElements.ConsoleLogin = \"Success\" }"

      + metric_transformation {
          + name      = "ops2_ConsoleLogin_Success"
          + namespace = "ops_alarms"
          + unit      = "Count"
          + value     = "1"
        }
    }

  # module.ops_alarms.aws_cloudwatch_metric_alarm.alarm_failure["ops1"] will be created
  + resource "aws_cloudwatch_metric_alarm" "alarm_failure" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_name                            = "ops1_ConsoleLogin_Failure_alarm_failure"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ops1_ConsoleLogin_Failure"
      + namespace                             = "ops_alarms"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # module.ops_alarms.aws_cloudwatch_metric_alarm.alarm_failure["ops2"] will be created
  + resource "aws_cloudwatch_metric_alarm" "alarm_failure" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_name                            = "ops2_ConsoleLogin_Failure_alarm_failure"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ops2_ConsoleLogin_Failure"
      + namespace                             = "ops_alarms"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # module.ops_alarms.aws_cloudwatch_metric_alarm.alarm_success["ops1"] will be created
  + resource "aws_cloudwatch_metric_alarm" "alarm_success" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_name                            = "ops1_ConsoleLogin_Success_alarm_success"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ops1_ConsoleLogin_Success"
      + namespace                             = "ops_alarms"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # module.ops_alarms.aws_cloudwatch_metric_alarm.alarm_success["ops2"] will be created
  + resource "aws_cloudwatch_metric_alarm" "alarm_success" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_name                            = "ops2_ConsoleLogin_Success_alarm_success"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ops2_ConsoleLogin_Success"
      + namespace                             = "ops_alarms"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

Plan: 10 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>